---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCHybridImport.Dispose
source: html/cc567ee4-1f34-6853-3062-3d4aafdacec4.htm
---
# Autodesk.Revit.DB.IFC.IFCHybridImport.Dispose Method

Releases all resources used by the IFCHybridImport

## Syntax (C#)
```csharp
public void Dispose()
```